IDEA Open Model
TypeDuration Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Duration of load case
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum TypeDuration
Public Enumeration TypeDuration
Members
Member name | Value | Description
LongTerm | 0 |  Long term
MediumTerm | 1 |  Medium term
ShortTerm | 2 |  Short term
InstantaneousTerm | 3 |  Instantaneous term
See Also
Reference
IdeaRS.OpenModel.Loading Namespace